Revit 2027 API
AccessLevel Enumeration
 Defines access levels to objects in the Extensible Storage framework.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AccessLevel
Public Enumeration AccessLevel
public enum class AccessLevel
type AccessLevel
Members
Member name | Value | Description
Application | 3 |  Only application that created the object has access to it.
Public | 1 |  Anybody has access to the object.
Vendor | 2 |  Only object vendor has access to it.
See Also
Reference
Autodesk.Revit.DB.ExtensibleStorage Namespace